keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_regdef.h
/** \\brief  Transmission Request Register 2 */
typedef struct _Ifx_ERAY_TXRQ2_Bits
{
    unsigned int TXR32:1;                   /**< \brief [0:0] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR33:1;                   /**< \brief [1:1] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR34:1;                   /**< \brief [2:2] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR35:1;                   /**< \brief [3:3] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR36:1;                   /**< \brief [4:4] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR37:1;                   /**< \brief [5:5] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR38:1;                   /**< \brief [6:6] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR39:1;                   /**< \brief [7:7] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR40:1;                   /**< \brief [8:8] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR41:1;                   /**< \brief [9:9] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR42:1;                   /**< \brief [10:10] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR43:1;                   /**< \brief [11:11] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR44:1;                   /**< \brief [12:12] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR45:1;                   /**< \brief [13:13] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR46:1;                   /**< \brief [14:14] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR47:1;                   /**< \brief [15:15] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR48:1;                   /**< \brief [16:16] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR49:1;                   /**< \brief [17:17] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR50:1;                   /**< \brief [18:18] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR51:1;                   /**< \brief [19:19] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR52:1;                   /**< \brief [20:20] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR53:1;                   /**< \brief [21:21] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR54:1;                   /**< \brief [22:22] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR55:1;                   /**< \brief [23:23] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR56:1;                   /**< \brief [24:24] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR57:1;                   /**< \brief [25:25] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR58:1;                   /**< \brief [26:26] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR59:1;                   /**< \brief [27:27] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR60:1;                   /**< \brief [28:28] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR61:1;                   /**< \brief [29:29] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR62:1;                   /**< \brief [30:30] Transmission Request n (n=32-63) (rh) */
    unsigned int TXR63:1;                   /**< \brief [31:31] Transmission Request n (n=32-63) (rh) */
} Ifx_ERAY_TXRQ2_Bits;

/** \\brief  Transmission Request Register 3 */
typedef struct _Ifx_ERAY_TXRQ3_Bits
{
    unsigned int TXR64:1;                   /**< \brief [0:0] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR65:1;                   /**< \brief [1:1] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR66:1;                   /**< \brief [2:2] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR67:1;                   /**< \brief [3:3] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR68:1;                   /**< \brief [4:4] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR69:1;                   /**< \brief [5:5] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR70:1;                   /**< \brief [6:6] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR71:1;                   /**< \brief [7:7] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR72:1;                   /**< \brief [8:8] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR73:1;                   /**< \brief [9:9] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR74:1;                   /**< \brief [10:10] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR75:1;                   /**< \brief [11:11] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR76:1;                   /**< \brief [12:12] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR77:1;                   /**< \brief [13:13] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR78:1;                   /**< \brief [14:14] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR79:1;                   /**< \brief [15:15] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR80:1;                   /**< \brief [16:16] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR81:1;                   /**< \brief [17:17] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR82:1;                   /**< \brief [18:18] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR83:1;                   /**< \brief [19:19] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR84:1;                   /**< \brief [20:20] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR85:1;                   /**< \brief [21:21] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR86:1;                   /**< \brief [22:22] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR87:1;                   /**< \brief [23:23] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR88:1;                   /**< \brief [24:24] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR89:1;                   /**< \brief [25:25] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR90:1;                   /**< \brief [26:26] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR91:1;                   /**< \brief [27:27] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR92:1;                   /**< \brief [28:28] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR93:1;                   /**< \brief [29:29] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR94:1;                   /**< \brief [30:30] Transmission Request n (n=64-95) (rh) */
    unsigned int TXR95:1;                   /**< \brief [31:31] Transmission Request n (n=64-95) (rh) */
} Ifx_ERAY_TXRQ3_Bits;

