keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_regdef.h
/** \\brief  GTU Configuration Register 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC08_Bits B;
} Ifx_ERAY_GTUC08;

/** \\brief  GTU Configuration Register 9 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC09_Bits B;
} Ifx_ERAY_GTUC09;

/** \\brief  GTU Configuration Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC10_Bits B;
} Ifx_ERAY_GTUC10;

/** \\brief  GTU Configuration Register 11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC11_Bits B;
} Ifx_ERAY_GTUC11;

/** \\brief  Input Buffer Command Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_IBCM_Bits B;
} Ifx_ERAY_IBCM;

/** \\brief  Input Buffer Command Request */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_IBCR_Bits B;
} Ifx_ERAY_IBCR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ID_Bits B;
} Ifx_ERAY_ID;

/** \\brief  Service Request Line Enable */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ILE_Bits B;
} Ifx_ERAY_ILE;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_KRST0_Bits B;
} Ifx_ERAY_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_KRST1_Bits B;
} Ifx_ERAY_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_KRSTCLR_Bits B;
} Ifx_ERAY_KRSTCLR;

/** \\brief  Lock Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_LCK_Bits B;
} Ifx_ERAY_LCK;

/** \\brief  Last Dynamic Transmit Slot */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_LDTS_Bits B;
} Ifx_ERAY_LDTS;

/** \\brief  Message Buffer Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBS_Bits B;
} Ifx_ERAY_MBS;

/** \\brief  Message Buffer Status Changed 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC1_Bits B;
} Ifx_ERAY_MBSC1;

/** \\brief  Message Buffer Status Changed 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC2_Bits B;
} Ifx_ERAY_MBSC2;

/** \\brief  Message Buffer Status Changed 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC3_Bits B;
} Ifx_ERAY_MBSC3;

/** \\brief  Message Buffer Status Changed 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MBSC4_Bits B;
} Ifx_ERAY_MBSC4;

/** \\brief  MHD Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MHDC_Bits B;
} Ifx_ERAY_MHDC;

/** \\brief  Message Handler Constraints Flags */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MHDF_Bits B;
} Ifx_ERAY_MHDF;

/** \\brief  Message Handler Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MHDS_Bits B;
} Ifx_ERAY_MHDS;

/** \\brief  Message RAM Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MRC_Bits B;
} Ifx_ERAY_MRC;

/** \\brief  Message Buffer Status Changed Interrupt Control 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC1_Bits B;
} Ifx_ERAY_MSIC1;

/** \\brief  Message Buffer Status Changed Interrupt Control 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC2_Bits B;
} Ifx_ERAY_MSIC2;

/** \\brief  Message Buffer Status Changed Interrupt Control 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC3_Bits B;
} Ifx_ERAY_MSIC3;

