keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_regdef.h
/** \\brief  Message Buffer Status Changed Interrupt Control 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MSIC4_Bits B;
} Ifx_ERAY_MSIC4;

/** \\brief  Macrotick and Cycle Counter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_MTCCV_Bits B;
} Ifx_ERAY_MTCCV;

/** \\brief  New Data Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT1_Bits B;
} Ifx_ERAY_NDAT1;

/** \\brief  New Data Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT2_Bits B;
} Ifx_ERAY_NDAT2;

/** \\brief  New Data Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT3_Bits B;
} Ifx_ERAY_NDAT3;

/** \\brief  New Data Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDAT4_Bits B;
} Ifx_ERAY_NDAT4;

/** \\brief  New Data Interrupt Control 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC1_Bits B;
} Ifx_ERAY_NDIC1;

/** \\brief  New Data Interrupt Control 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC2_Bits B;
} Ifx_ERAY_NDIC2;

/** \\brief  New Data Interrupt Control 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC3_Bits B;
} Ifx_ERAY_NDIC3;

/** \\brief  New Data Interrupt Control 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NDIC4_Bits B;
} Ifx_ERAY_NDIC4;

/** \\brief  NEM Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NEMC_Bits B;
} Ifx_ERAY_NEMC;

/** \\brief  Network Management Vector */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_NMV_Bits B;
} Ifx_ERAY_NMV;

/** \\brief  Output Buffer Command Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OBCM_Bits B;
} Ifx_ERAY_OBCM;

/** \\brief  Output Buffer Command Request */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OBCR_Bits B;
} Ifx_ERAY_OBCR;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OCS_Bits B;
} Ifx_ERAY_OCS;

/** \\brief  Offset Correction Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OCV_Bits B;
} Ifx_ERAY_OCV;

/** \\brief  Odd Sync ID Symbol Window */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OSID_Bits B;
} Ifx_ERAY_OSID;

/** \\brief  OCDS Trigger Set Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_OTSS_Bits B;
} Ifx_ERAY_OTSS;

/** \\brief  PRT Configuration Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_PRTC1_Bits B;
} Ifx_ERAY_PRTC1;

/** \\brief  PRT Configuration Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_PRTC2_Bits B;
} Ifx_ERAY_PRTC2;

/** \\brief  Rate Correction Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RCV_Bits B;
} Ifx_ERAY_RCV;

/** \\brief  Read Data Section */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDDS_Bits B;
} Ifx_ERAY_RDDS;

/** \\brief  Read Header Section 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDHS1_Bits B;
} Ifx_ERAY_RDHS1;

/** \\brief  Read Header Section 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDHS2_Bits B;
} Ifx_ERAY_RDHS2;

/** \\brief  Read Header Section 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_RDHS3_Bits B;
} Ifx_ERAY_RDHS3;

